socialNetwork/wrk2/test-run/COMMAND_20/60
Running 1m test @ http://localhost:31111/wrk2-api/post/compose
  1 threads and 1 connections
  Thread calibration: mean lat.: 1067.116ms, rate sampling interval: 2725ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.49s   167.89ms   1.82s    63.24%
    Req/Sec   202.28      4.68   211.00     72.22%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.49s 
 75.000%    1.62s 
 90.000%    1.71s 
 99.000%    1.82s 
 99.900%    1.87s 
 99.990%    1.89s 
 99.999%    1.89s 
100.000%    1.89s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1009.151     0.000000            1         1.00
    1265.663     0.100000         1016         1.11
    1335.295     0.200000         2040         1.25
    1391.615     0.300000         3050         1.43
    1442.815     0.400000         4058         1.67
    1494.015     0.500000         5082         2.00
    1519.615     0.550000         5595         2.22
    1545.215     0.600000         6090         2.50
    1571.839     0.650000         6597         2.86
    1597.439     0.700000         7094         3.33
    1624.063     0.750000         7610         4.00
    1637.375     0.775000         7852         4.44
    1651.711     0.800000         8105         5.00
    1666.047     0.825000         8364         5.71
    1681.407     0.850000         8635         6.67
    1695.743     0.875000         8863         8.00
    1704.959     0.887500         9004         8.89
    1713.151     0.900000         9128        10.00
    1721.343     0.912500         9251        11.43
    1730.559     0.925000         9373        13.33
    1741.823     0.937500         9505        16.00
    1747.967     0.943750         9568        17.78
    1754.111     0.950000         9624        20.00
    1760.255     0.956250         9689        22.86
    1768.447     0.962500         9756        26.67
    1775.615     0.968750         9815        32.00
    1780.735     0.971875         9853        35.56
    1784.831     0.975000         9876        40.00
    1790.975     0.978125         9914        45.71
    1796.095     0.981250         9942        53.33
    1802.239     0.984375         9971        64.00
    1806.335     0.985938         9992        71.11
    1810.431     0.987500        10008        80.00
    1813.503     0.989062        10019        91.43
    1818.623     0.990625        10035       106.67
    1824.767     0.992188        10053       128.00
    1827.839     0.992969        10058       142.22
    1829.887     0.993750        10066       160.00
    1833.983     0.994531        10076       182.86
    1838.079     0.995313        10085       213.33
    1841.151     0.996094        10090       256.00
    1842.175     0.996484        10094       284.44
    1846.271     0.996875        10099       320.00
    1847.295     0.997266        10102       365.71
    1852.415     0.997656        10108       426.67
    1856.511     0.998047        10112       512.00
    1856.511     0.998242        10112       568.89
    1861.631     0.998437        10115       640.00
    1862.655     0.998633        10116       731.43
    1866.751     0.998828        10118       853.33
    1870.847     0.999023        10120      1024.00
    1873.919     0.999121        10121      1137.78
    1874.943     0.999219        10122      1280.00
    1879.039     0.999316        10124      1462.86
    1879.039     0.999414        10124      1706.67
    1883.135     0.999512        10125      2048.00
    1883.135     0.999561        10125      2275.56
    1884.159     0.999609        10126      2560.00
    1884.159     0.999658        10126      2925.71
    1887.231     0.999707        10127      3413.33
    1887.231     0.999756        10127      4096.00
    1887.231     0.999780        10127      4551.11
    1888.255     0.999805        10128      5120.00
    1888.255     0.999829        10128      5851.43
    1888.255     0.999854        10128      6826.67
    1888.255     0.999878        10128      8192.00
    1888.255     0.999890        10128      9102.22
    1892.351     0.999902        10129     10240.00
    1892.351     1.000000        10129          inf
#[Mean    =     1490.780, StdDeviation   =      167.892]
#[Max     =     1891.328, Total count    =        10129]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  12118 requests in 1.00m, 2.48MB read
Requests/sec:    201.95
Transfer/sec:     42.40KB